const DetailsInfo = () => {
    return (
        <>
            <div className="poster">
                <div className="panel">
                    
                </div>
                <div className="labels"></div>
                <p className="text">Хочу сходить в коктейльный бар, выпить пару коктейлей и пообщаться.</p>
            </div>
            <div className="description">
                <h4 className="headline">Био</h4>
                <p className="text">Много работаю ( просто пекарь, бариста, кассир)) Играю на виолончели 🎻 Люблю гулять на свежем воздухе...Много работаю ( просто пекарь, бариста, кассир)) Играю на виолончели 🎻 Люблю гулять на свежем воздухе</p>
            </div>
        </>
    )
}

export default DetailsInfo